ensemble-learning/test_cases/S809-airfoil/inputs/foam_base/foam_base_AoA8/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
71770
(
(0.132863 0.0059697 -2.92828e-23)
(0.136644 0.00463589 4.38706e-23)
(0.143682 0.00285503 -1.52487e-17)
(0.157882 0.000831662 -3.75102e-18)
(0.167011 0.000439802 1.8013e-18)
(0.166798 0.000361076 0)
(0.167072 0.000279319 0)
(0.166783 0.000187064 8.46657e-19)
...
)
;

boundaryField
{
    farfield
    {
        type            freestreamVelocity;
        freestreamValue uniform (47.53 6.68 0);
        value           nonuniform List<vector> 
160
(
(47.5621 6.54033 8.90765e-18)
(47.5644 6.53808 0)
(47.494 6.53128 -1.14813e-17)
(47.4323 6.52165 -3.48481e-24)
(47.508 6.53022 1.4624e-22)
(47.5559 6.53917 3.88992e-20)
(47.5489 6.5388 0)
(47.5435 6.53825 4.34408e-21)
...
)
;
    }
    walls
    {
        type            noSlip;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
