ensemble-learning/test_cases/S809-airfoil/inputs/foam_base/foam_base_AoA8/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
71770
(
0.000507885
0.000536685
0.000592852
0.000715298
0.000800263
0.000798326
0.000801037
0.000798358
...
)
;

boundaryField
{
    farfield
    {
        type            freestream;
        freestreamValue uniform 0.001;
        value           nonuniform List<scalar> 
160
(
0.000164691
0.00149982
0.0157011
0.0266444
0.0123186
0.00127555
3.58037e-05
0.000175128
...
)
;
    }
    walls
    {
        Ceps2           1.9;
        Ck              -0.416;
        Bk              8.366;
        C               11;
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
621
(
4.86686e-10
7.08057e-11
6.16171e-11
2.84987e-11
1.85232e-11
2.08189e-11
2.27561e-11
2.29091e-11
...
)
;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
