ensemble-learning/test_cases/S809-airfoil/inputs/foam_base/foam_base_AoA8/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
71770
(
3.42601e-13
3.62022e-13
3.99905e-13
4.82512e-13
5.39842e-13
5.38536e-13
5.40365e-13
5.38557e-13
...
)
;

boundaryField
{
    farfield
    {
        type            freestream;
        freestreamValue uniform 5.4e-05;
        value           nonuniform List<scalar> 
160
(
3.42563e-05
0.00032315
0.00244125
0.00332988
0.00206467
0.000273785
7.37558e-06
3.53353e-05
...
)
;
    }
    walls
    {
        type            nutUSpaldingWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
621
(
6.07177e-12
2.93638e-12
2.78781e-12
2.0846e-12
1.77248e-12
1.85261e-12
1.91592e-12
1.92091e-12
...
)
;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
