ensemble-learning/test_cases/S809-airfoil/inputs/foam_base/foam_base_AoA8/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
71770
(
357.039
356.654
354.433
348.746
334.944
327.017
320.501
314.864
...
)
;

boundaryField
{
    farfield
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
        value           nonuniform List<scalar> 
160
(
-2.40909e-05
-2.36865e-05
2.14987e-06
1.68632e-08
-7.08449e-07
-0.000188393
2.42163e-05
-1.04678e-05
...
)
;
    }
    walls
    {
        type            zeroGradient;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
