ensemble-learning/test_cases/S809-airfoil/inputs/foam_base/foam_base_AoA8/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs
{
    type            forceCoeffs;

    libs            (forces);

    writeControl    timeStep;
    timeInterval    100;

    log             yes;

    patches         (walls);; //(motorBikeGroup);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.29;           // Required when rho = rhoInf
    liftDir         (-0.14054 1 0);
    dragDir         (1 0.14054 0);
    CofR            (0 0 0);  // Axle midpoint on ground
    pitchAxis       (0 0 1);
    magUInf         48;
    lRef            0.6;        // Chord length
    Aref            0.0006;        // Estimated
    /*
    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    */
}


// ************************************************************************* //
